{
  "language": "es",
  "dark_mode": "Modo Oscuro",
  "home_welcome": "Hola",
  "home_i": "soy",
  "home_what_i_do": "Diseño páginas web increíbles",
  "home_job": "Desarrollador Full Stack, Freelancer y apasionado por Github.",
  "home_location": "Ubicado en Santiago, Chile.",
  "home_contact_btn": "Contactar",
  "menu_home": "Inicio",
  "menu_about": "Sobre Mi",
  "menu_projects": "Proyectos",
  "menu_experience": "Experiencia",
  "menu_contact": "Contacto",
  "menu_resume": "Resume",
  "about_desc": "Hola, mi nombre es Diego Toro Reyes. Mi formación en análisis de sistemas me ha proporcionado un pensamiento crítico y analítico a lo largo de mi carrera profesional. Soy proactivo, innovador y comprometido. Listo para enfrentar nuevos desafíos y contribuir en mi campo profesional.",
  "experience_0_job": "Full stack web developer",
  "experience_0_overview": "Code Hub is a space where code lovers are based in Sousse: some are freelancers, some started their startups, others work as remote developers. it's a place where we discuss about new technologies, about IT solutions, about anything in relation to Code, we also do workshops and offer a calm coworking space to the members.",
  "experience_0_duration": "Jan 2021 - Present",
  "experience_1_job": "Front-end web developer",
  "experience_1_overview": "Vapoter.tn is an e-commerce website that sells anything in relation with vapes. unfortunately, Tunisia has a restricted system and it's now forbidden to sell vape products. so, the website closed.",
  "experience_1_duration": "September 2018 - December 2018",
  "view_project_label_hover": "Ver Proyecto",
  "projects_1_overview": "Tunflix is the tunisian Netflix.",
  "projects_2_overview": "Code Hub is a hub for code lovers in Sousse, Tunisia",
  "projects_3_overview": "Burpees.io is a solution for gyms.",
  "projects_1_extended_overview": "Tunflix is a streaming website: it allows you to watch movies by scraping data from the internet. The UI is modern and base on material design",
  "projects_2_extended_overview": "codehub.tn is a showcase website for Code Hub: a coworking space at Sousse for developers",
  "projects_3_extended_overview": "Burpees.io is a solution for gyms. you can see plannings, take reservations and more. We've developed a white labalise app: If a client wants his native application it will be generated automatically. The dashboard is for the gym owner.",
  "contact_full_name": "Nombre Completo",
  "contact_email": "Dirección de correo",
  "contact_input_message": "Mensaje",
  "contact_btn": "Enviar Mensaje",
  "contact_send_success": "Tu mensaje ha sido enviado exitosamente, te responderé lo antes posible."
}