[
  {
    "id": 0,
    "company": "Confites Cookieman Ltda.",
    "jobTitle": "Analista de sistemas (Fullstack)",
    "fromDate": "06/2017",
    "toDate": "05/2019",
    "project": false,
    "description": "Me desempeñe en el área de sistemas, desarrollando sobre el ERP FrountAccounting creando y modificando módulos de compra y venta, contabilidad, bodega e inventario, despacho y configuraciones de este.Conocimientos del prototipo de facturación que imparte  SII a empresas. Se generaron procedimientos de almacenado en PL/SQL que trabajaría junto a las órdenes de compra, agrupando todas las solicitudes de esta, aparte de generar funcionesque optimizaran el ERP. Todo esto desarrollado en un ambiente prueba, con el fin de mejorar el ambiente de producción ya implementado para la migración de su antiguo sistema basado COBOL, preparándolo para los distintos locales de la empresa (TIP-TOP / GELATO´S). Por cada módulo, realicé capacitaciones presenciales al personal de la  empresa demostrando funcionalidad y aplicando la práctica, además de asistencias a los usuarios en puestos de trabajo, así poder analizar posibles mejoras de rendimientos por módulos.",
    "references": [
      {
        "name": "Michael Martinez",
        "phone": "+56942594251",
        "email": null,
        "active": true
      }
    ]
  },
  {
    "id": 1,
    "company": "automovilclub",
    "jobTitle": "Analista de sistemas FullStack",
    "fromDate": "05/2019",
    "toDate": "9/2019",
    "project": true,
    "description": "Participe en un proyecto, como fullstack, en el desarrollo de distintos sistemas híbridos, sistemas escuela internos y desarrollando módulos, entre los sistemas que desarrolle, se encuentra la credencial virtual de socios de Automóvil Club Chile y un gestor de convenios con empresas externas, el que apoya en la gestion a los participantes de distintos cursos de conducción, capacitaciones y entre otras actividades que incluya la promocion ofrecida por el sponsor descrito en la siguiente lista. Además de formar parte de la toma de decisiones del holding de Automóvil club y sus distintas empresas. Al comienzo trabajé fuertemente con el área de marketing utilizando el gestor de contenidos de Modyo junto a las jefaturas del área, dando apoyo al nuevo proyecto para la corredora de seguros que forma parte de automóvil club (MACC corredora de seguros), utilizamos CRM para administrar y guardar la información ingresada por todos los formularios mantenidos en la página de automovilclub.cl. Realice una instalación de Moodle, para utilizarlo un tipo classroom para los alumnos que participaban de las clases de conducción online",
    "links": {
      "instagram": "https://www.instagram.com/vapoter.tn/"
    }
  },
  {
    "id": 2,
    "company": "Fabrimetal S.A.",
    "jobTitle": "Ingeniero en Desarrollo (Remoto En Pandemia)",
    "fromDate": "10/2019",
    "toDate": "08/2020",
    "project": false,
    "description": "Empresa de arquitectura de ascensores certificada por Kone, en donde me desempeñe en el área de servicios e informática, cargo de Ingeniero en Desarrollo Full Stack. Desarrollamos módulos y correcciones de las diferentes plataformas incorporadas a la empresa, realizando propuestas innovadoras para mejorar la experiencia del usuario al momento de desempeñar su trabajo. En base a un requerimiento para mayor control de la información ante los usuarios, desarrolle Pandora, un sistema que incorpora seguridad, control de permisos, asignación de perfiles, creación de secciones y módulos automáticosmejorando la experiencia en desarrollo del programador, basados en PHP nativo, JavaScript,JQuery, Gentelella e incorpora librerías propias de componentes. Asistí en soporte con usuarios, capacitaciones, manuales digitales, asistencia en redes, creación de credenciales con asignación de permisos, documentación. Se realizaron propuestas para unificar lossistemas, dando inicio la migración a pandora en forma de propuesta, reforzando seguridad y control de información, además de la implementación de una caja de aplicaciones en donde los usuarios podrían encontrar todas las aplicaciones de la empresa en una misma plataforma. Durante el periodo de cuarentena, nos comenzamos con teletrabajo y para su control creamos una bitácora laboral, en donde el trabajador debía ingresar sus actividadesdiarias o tomar las asignadas por el jefeencargado del área, y para el asegurar el uso se nosasignaron tareas de controller para asistir al usuario en su uso.",
    "links": {}
  }
]
